Revit 2026 API

# IFCPropertySetMappingInfo Class

---

Represents the IFC property set mapping information stored in the template.

SystemObject Autodesk.Revit.DBIFCPropertySetMappingInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCPropertySetMappingInfo : IDisposable
```
```vb
Public Class IFCPropertySetMappingInfo
	Implements IDisposable
```
```cpp
public ref class IFCPropertySetMappingInfo : IDisposable
```
```fsharp
type IFCPropertySetMappingInfo =
    class
        interface IDisposable
    end
```

The IFCPropertySetMappingInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCPropertySetMappingInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace